水果 = {"蘋果": 25, "香蕉": 20, "橘子": 30}
while True:
    print("目前水果價格")
    for key in 水果:
        print(key, ":", 水果[key], "元")
    print("1.新增水果價格")
    print("2.修改水果價格")
    print("3.刪除水果")
    print("4.離開")
    選擇 = input("請選擇功能(1~4): ")
    if 選擇 == "1":
        新水果 = input("請輸入你要新增的水果名稱:")
        新價格 = input(f"請輸入{新水果}的價格")
        水果[新水果] = 新價格
        print(新水果, "以新增，價格", 新價格)
    elif 選擇 == "2":
        新水果 = input("請輸入你要修改的水果名稱:")
        新價格 = input(f"請輸入{新水果}的新價格")
        水果[新水果] = 新價格
        print(新水果, "以修改為", 新價格, "元")
    elif 選擇 == "3":
        新水果 = input("請輸入你要刪除的水果名稱:")
        del 水果[新水果]
        print(新水果, "以刪除")
    elif 選擇 == "4":
        print("感謝使用水果店價格諮詢系統")
        break
    else:
        print("請輸入正確的選項")
